In [1]:
import pandas as pd

In [6]:
data = [['Alice', 25], ['Bob', 30], ['Charlie', 35],['Rancel', 35],['Jonas', 25],['Julia', 14]]
df_datos= pd.DataFrame(data, columns=['Name', 'Age'])

In [26]:
df_datos

      Name  Age  Years
0    Alice   25   2004
1      Bob   30   2005
2  Charlie   35   2002
3   Rancel   35   2007
4    Jonas   25   2010
5    Julia   14   2013

In [28]:
df_datos.query("Age>=10")

      Name  Age  Years
0    Alice   25   2004
1      Bob   30   2005
2  Charlie   35   2002
3   Rancel   35   2007
4    Jonas   25   2010
5    Julia   14   2013

In [20]:
df_datos["Years"] = [2004,2005,2002,2007,2010,2013]

In [25]:
df_datos = df_datos.drop('Birthday', axis=1)

In [30]:
print(df_datos)

      Name  Age  Years
0    Alice   25   2004
1      Bob   30   2005
2  Charlie   35   2002
3   Rancel   35   2007
4    Jonas   25   2010
5    Julia   14   2013

In [29]:
df_datos.to_csv("df_datos.csv")
df_datos.to_html("df_datos.html")
df_datos.to_json("df_datos.json")